#include<stdio.h>

int main() {
    char* caption[13]; // 1
    caption[0] = "สายตาสั้นเท่าไหร่ไม่รู้ ไปวัดดูก็มีแต่พระ";
    caption[1] = "ผับไม่เข้า เหล้าไม่กิน เช็คอินแค่วัด";
    caption[2] = "แค่เธอทักมาว่า \"มายัง\" เราก็เลยตอบกลับไปว่า \"ภันเต\"";
    caption[3] = "ทำบุญเขาว่าอย่าหวังผล แต่ถ้าอยากให้เธอสน ต้องท่องมนต์บทไหน";
    caption[4] = "เวียนเทียนเค้าให้เดินวน 3 รอบ แต่ถ้าเจอคนที่ชอบกี่รอบก็เดินได้";
    caption[5] = "ไปวัดได้บุญ ไปห้องคุณได้อะไร";
    caption[6] = "สายเมาเราไม่ถนัด เน้นแต่เข้าวัดกับสวดมนต์";
    caption[7] = "จะทำบุญก็ต้องเข้าวัด แต่ถ้าจะทำใจให้ไม่รัก ต้องทำยังไง";
    caption[8] = "เราเป็นคนชอบเข้าวัดทำบุญ พอๆ กับที่ชอบคุณนั่นแหละ";
    caption[9] = "ต้องทำบุญแค่ไหน ถึงจะได้ใจเธอ";
    caption[10] = "ปล่อยนก ปล่อยปลา ได้ทำบุญ แต่ปล่อยใจไปชอบคุณจะได้อะไร";
    caption[11] = "เข้าวัดก็อยากจะได้บุญ​ มองตาคุณก็อยากจะได้ใจ";

    char* random;
    srand(time(NULL));
    random = caption[rand() % 12];
    printf("%s\n", random);
    return;
}
